---
kind: property
id: P:Autodesk.Revit.DB.BasicFileInfo.CentralPath
source: html/7b646d50-585e-1c52-54f5-5b2eddc546a9.htm
---
# Autodesk.Revit.DB.BasicFileInfo.CentralPath Property

Returns the central model path.

## Syntax (C#)
```csharp
public string CentralPath { get; }
```